{
  "backend/main.mo": "Actor managing user profiles, products, and orders with access control and Stripe integration.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, light/dark themes, and base UI variables.",
  "frontend/index.html": "HTML entry point including meta tags, favicon, and script loading the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, main layout, and pages including admin and checkout flows.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard enforcing authentication and admin permissions with corresponding UI states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for entering and saving a user's name and optional email using saveCallerUserProfile.",
  "frontend/src/components/checkout/CheckoutButton.tsx": "Button that triggers checkout by creating a Stripe session, handling auth, cart validation, and errors.",
  "frontend/src/components/layout/StoreLayout.tsx": "Main store layout with header, auth controls, cart indicator, and optional profile setup dialog.",
  "frontend/src/components/States.tsx": "Reusable UI components for loading states, empty states, and product skeleton placeholders.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminProducts.ts": "Mutation hooks for creating, updating, and archiving products via the actor, invalidating product queries.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Mutation hook that requests a checkout session from the backend and parses the returned Stripe URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity auth, exposing identity, login, logout, and login status.",
  "frontend/src/hooks/useProducts.ts": "Query hooks for fetching all products or a single product through the actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching, saving, and checking admin status of the caller's user profile.",
  "frontend/src/index.css": "Tailwind base definitions and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for listing, searching, creating, editing, and archiving products using dialogs and product hooks.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item controls, quantity updates, removal, total display, and a checkout button, plus an empty state when no items exist.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero section, product categories, and a list of featured active products, linking to product browsing and the cart.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation message with options to return to the cart or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart after payment success, shows confirmation details, and optionally displays the payment session ID.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Loads and displays detailed product info, availability, and quantity selection, allowing users to add items to the cart if in stock.",
  "frontend/src/pages/ProductListPage.tsx": "Lists all active products with search, brand, and category filters, handling loading and error states.",
  "frontend/src/state/cart.ts": "Zustand store managing cart items with persistence, quantity updates, removal, and total calculation.",
  "frontend/src/utils/format.ts": "Utility functions for formatting prices in currency and timestamps into readable dates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and including typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing features, requirements, image assets, and architectural notes for the e-commerce app."
}